---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MultiReferenceAnnotationFailures.ElementCategoryChangeInvalidatesMultiReferenceAnnotation
source: html/b96e894f-5425-2855-ab64-1c91a48cfd8c.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MultiReferenceAnnotationFailures.ElementCategoryChangeInvalidatesMultiReferenceAnnotation Property

Elements have changed category. Multi-rebar annotations for these elements are now of the wrong category and will be deleted.

## Syntax (C#)
```csharp
public static FailureDefinitionId ElementCategoryChangeInvalidatesMultiReferenceAnnotation { get; }
```